---
type: TemporaryGraphicsManager
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# TemporaryGraphicsManager

`Autodesk.Revit.DB.TemporaryGraphicsManager` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddControl | 2022 | `public int AddControl ( InCanvasControlData data , ElementId ownerViewId )` |
| Method | Clear | 2022 | `public void Clear ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAll | 2022 | `public ICollection < int > GetAll ()` |
| Method | GetTemporaryGraphicsManager | 2022 | `public static TemporaryGraphicsManager GetTemporaryGraphicsManager ( Document document )` |
| Method | RemoveControl | 2022 | `public void RemoveControl ( int index )` |
| Method | SetVisibility | 2022 | `public void SetVisibility ( int index , bool visible )` |
| Method | UpdateControl | 2022 | `public void UpdateControl ( int index , InCanvasControlData data )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |